<template>
    <div class="policy">
       <h1>Политика конфиденциальности платформы ncfustudposts</h1> 

<h2>1. Общие положения</h2>

<span>1.1. Настоящая Политика конфиденциальности (далее – «Политика») определяет порядок обработки и защиты персональных данных пользователей платформы ncfustudpost (далее – «Платформа»), а также условия их использования.
</span>
<span>1.2. Пользователь, регистрируясь на Платформе, подтверждает свое согласие с условиями данной Политики.</span>

<h2>2. Обработка персональных данных</h2>

<span>2.1. Платформа собирает и обрабатывает персональные данные пользователей в целях предоставления услуг, предусмотренных Условиями использования Платформы.
</span>
<span>2.2. Персональные данные могут включать, но не ограничиваются: имя, фамилию, электронную почту, контактный телефон, IP-адрес и другие данные, предоставляемые пользователем при регистрации или использовании Платформы.
</span>
<span>2.3. Обработка персональных данных осуществляется в соответствии с законодательством о защите персональных данных.</span>

<h2>3. Использование персональных данных</h2>

<ul>3.1. Персональные данные пользователей используются исключительно для целей:
<li>Предоставления и улучшения услуг Платформы;</li>
<li>Поддержки связи с пользователями;</li>
<li>Информирования пользователей о новостях, обновлениях и предложениях Платформы;</li>
<li>Анализа использования Платформы и улучшения её функциональности.</li>
</ul>
<h2>4. Защита персональных данных</h2>

<span>4.1. Платформа принимает все необходимые технические и организационные меры для защиты персональных данных пользователей от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения и иных неправомерных действий.
</span>
<span>4.2. Доступ к персональным данным имеют только те сотрудники, которым это необходимо для выполнения служебных обязанностей.</span>
<h2>5. Передача персональных данных третьим лицам</h2>

<span>5.1. Платформа обязуется не передавать персональные данные пользователей третьим лицам без их согласия, за исключением случаев, предусмотренных законодательством.
</span>
<span>5.2. В случае реорганизации, слияния или продажи Платформы, персональные данные могут быть переданы правопреемнику при условии соблюдения им условий данной Политики.
</span>
<h2>6. Условия согласия на обработку персональных данных</h2>

<span>6.1. Пользователь дает согласие на обработку своих персональных данных, регистрируясь на Платформе и принимая условия данной Политики.
</span>
<span>6.2. Пользователь имеет право отозвать свое согласие на обработку персональных данных, направив соответствующее уведомление на электронную почту Платформы. В случае отзыва согласия, Платформа прекращает обработку персональных данных пользователя и уничтожает их в установленный законодательством срок.
</span>
<h2>7. Изменения в Политике конфиденциальности</h2>

<span>7.1. Платформа оставляет за собой право вносить изменения в настоящую Политику. Обо всех изменениях будет сообщено пользователям путем публикации обновленной версии Политики на сайте Платформы.
</span>
<span>7.2. Продолжение использования Платформы после внесения изменений означает согласие пользователя с новыми условиями Политики.
</span>
<h2>8. Контактная информация</h2>

<span>8.1. По всем вопросам, связанным с настоящей Политикой конфиденциальности, пользователи могут обращаться по следующему адресу электронной почты: wildcat2k21@gmail.com
</span>
    </div>
</template>

<script>    

export default {
    name: "policy-web"

}

</script>

<style scoped>  

    .policy
    {
        min-height: 100vh;
        display: flex;
        flex-direction: column;
    }

    h1
    {
        margin-bottom: 20px;
    }

    h2
    {
        margin-top: 15px;
        margin-bottom: 15px;
    }

    li::marker
    {
        color: #AC2DFE;
    }
    
</style>