<template>
    <div class="rules">
       <h1>Правила Поведения на Платформе ncfustudpost</h1>

На платформе ncfustudpost мы стремимся создать безопасное и дружелюбное сообщество для всех пользователей. Для достижения этой цели, мы просим всех пользователей соблюдать следующие правила:

<h1>Запрещено:</h1>

<h2>Использование негативной и нецензурной лексики:</h2>
Комментарии и посты, содержащие оскорбительные, грубые или нецензурные выражения, не допускаются.

<h2>Публикация отталкивающих постов и комментариев:</h2>
Любые материалы, которые могут вызвать негативные эмоции или являются неуместными, не разрешены.

<h2>Размещение отталкивающих картинок:</h2>
Запрещается публиковать изображения, которые могут быть восприняты как неприятные, шокирующие или оскорбительные.

<h2>Дискриминационные материалы:</h2>
Посты и комментарии, дискриминирующие по расовой, национальной принадлежности, половому признаку, возрасту, религиозным убеждениям или иным признакам, строго запрещены.

<h2>Материалы сексуального или откровенного содержания:</h2>
Запрещается публиковать материалы, содержащие сексуальный подтекст или откровенные изображения.

<h2>Мы оставляем за собой право удалять любые посты или комментарии, нарушающие эти правила, а также блокировать аккаунты пользователей, неоднократно нарушающих правила сообщества.
</h2>
Благодарим за понимание и соблюдение данных правил.
    </div>
</template>

<script>    

export default {
    name: "rules-web"

}

</script>

<style scoped>  
    .rules
    {
        width: 100vw;
        height: 100vh;
        display: flex;
        flex-direction: column;
    }

    h1
    {
        margin-top: 20px;
        margin-bottom: 20px;
    }

    h2
    {
        margin-top: 15px;
        margin-bottom: 15px;
    }

    li::marker
    {
        color: #AC2DFE;
    }
</style>